{
    "data":[
        {
            "id":1,
            "images":["LobangCorner/LobangCorner_FeaturePreview.png","LobangCorner/LobangCorner_Preview-01.png","LobangCorner/LobangCorner_Preview-02.png","LobangCorner/LobangCorner_Preview-03.png","LobangCorner/LobangCorner_Preview-04.png","LobangCorner/LobangCorner_Preview-05.png","LobangCorner/LobangCorner_Preview-06.png","LobangCorner/LobangCorner_Slide-01.png","LobangCorner/LobangCorner_Slide-01-01.png","LobangCorner/LobangCorner_Slide-02-01.png","LobangCorner/LobangCorner_Slide-03-01.png","LobangCorner/LobangCorner_Slide-02.png","LobangCorner/LobangCorner_Slide-03.png","LobangCorner/LobangCorner_Slide-04.png","LobangCorner/LobangCorner_Slide-05.png"],
            "video":"",
            "title":"LobangCorner: an Android Application to Preserve Hawker Culture",
            "description":"An android application built for an assignment, LobangCorner aims to bring back the joy and love of sharing with its blogging and recipe features, while providing a space to promote hawker and local businesses.",
            "flairs":["assignment","android"],
            "date":"Aug 2022",
            "about":"LobangCorner is a social Android Application created for the ‘Mobile Application & Development’ module in Year 2 of studying in Ngee Ann Polytechnic. \n Although not a requirement in the assignment, LobangCorner was built and designed with a purpose and goal in mind. The app is a community for Singaporean food enthusiasts to share about their favourite hawker stalls and recipes. Centered around the theme of “Preserving Hawker Culture”, the primary goal of the app is to revive and support hawker businesses by bringing out the Singaporean spirit of sharing through its community. \n The app consists of two main features: Hawker Corner & Recipe Corner. Hawker Corner is the main focus of the application allowing both local food enthusiasts and hawkers themselves to blog about their own/favourite stalls. Recipe Corner was also added as a side feature for users to share their best delectable home recipes that others can replicate, to taste the flavours of different cultures and homes. (Almost like neighbours sharing their homemade food with one another!) \n In essence, the app aims to bring Singapore’s Hawker Culture back to life with its blogging features by giving a voice to local food enthusiasts, businesses and homecooks. \n",
            "roles":"Team Lead, Design Lead, Home Page Developer.\n As the creator of the concept ‘LobangCorner’, I was the visionary of the team that led my team of 5 to completion of the assignment.  It was my responsibility to drive us in the right direction towards the idea I had in mind of LobangCorner, such as aligning our features in the app to be in line with our eventual goal. I also overlooked the progress of the team every step of the way and arranged our weekly meetings.\n Besides being the project lead, I also handled the overall artistic direction of the application such as designing the colour palette of the app, the UI and the creation of the logo as well. As a developer, I mainly handled the Home page of the application which was a challenge technical wise needing to apply more advanced concepts such as a nested recycler view. It is through this role and assignment that I managed to understand and apply the concept of MVC.\n",
            "learned":"LobangCorner is truly personal to me as it was my first original idea that I could implement and create. Leading the team consisting of 4 other developers (besides myself) that fully trusted my vision was a privilege and an experience. It was a struggle initially as neither of us have created an android application before and our project was filled with a lot of uncertainty, I also wasn't experienced in leading software projects especially with such a big team. But with my team’s trust and support we managed to overcome all obstacles and deliver a complete product. It was through their cooperation and enthusiasm that we, as a team, managed to achieve the vision that I’ve set out to accomplish from the beginning.\n There are many lessons that I’ve learned over this project and one of the greatest was how crucial it is to design software structures to be scalable and flexible from the beginning. As we progressed through the timeline, the team realized that our planned approach of designing classes was very restrictive and non-standardized, making it difficult to use both classes in the same view. Although we managed to create some workarounds, this issue stressed the importance of planning before beginning which would have saved us a lot of trouble.\n Nonetheless, my team and I are extremely proud of the results that we have achieved and the lessons learnt from this project in the process of creating LobangCorner. Thank you for reading. \n            ",
            "members":["Wang Yongqing (self)", "Celsius Chia", "Chan Zi Xian", "Hasanah", "Lai Yong Chuen"],
            "achievements":"Grade: A/A+",
            "technologies":["Language(s) / Framework(s): Android Java","IDE: Android Studio","Adobe Illustrator"],
            "links":[{"github":"https://github.com/beefwhale/LobangCorner"}]
        },
        {
            "id":2,
            "images":["AWSBuildOn2022/AWSBuildOn2022_Slide.png","AWSBuildOn2022/AWSBuildOn2022_Slide_01.png","AWSBuildOn2022/AWSBuildOn2022_Slide_02.png","AWSBuildOn2022/AWSBuildOn2022_Slide_03.png","AWSBuildOn2022/AWSBuildOn2022_Slide_04.png","AWSBuildOn2022/AWSBuildOn2022_Slide_05.png","AWSBuildOn2022/AWSBuildOn2022_Slide_06.png","AWSBuildOn2022/AWSBuildOn2022_Slide_07.png","AWSBuildOn2022/AWSBuildOn2022_Slide_08.png","AWSBuildOn2022/AWSBuildOn2022_Slide_09.png","AWSBuildOn2022/AWSBuildOn2022_Slide_12.png","AWSBuildOn2022/AWSBuildOn2022_Slide_11.png"],
            "video":"https://youtu.be/Cq3ufhtkiLg",
            "title":"AWS Build On Hackathon 2022",
            "description":"How we managed to clinch first place in the hackathon by creating a solution for the ZALORA problem statement with the use of AWS technologies.",
            "flairs":["hackathon"],
            "date":"Oct 2022",
            "about":"Watch the youtube video for the full demonstration and an explanation on the architecture. (I apologize for the rushed speech, it was filmed on the same day and my adrenaline was PUMPING)\n The AWS Build On Hackathon 2022 Challenge was the first hackathon I took part in. Like many hackathons, the goal of the challenge was to solve problem statements given using AWS Technologies. \n There were two problem statements provided this year, but one my team selected was the problem statement given by ZALORA: “Develop a solution that provides ZALORA's diverse range of shoppers with the confidence that they are selecting the right size when shopping online”.\n Through our research and exploration into ZALORA’s online store, we narrowed down the problems into two main ones. Users have to manually measure their body measurements every time, and have to manually convert and compare measurements to the size guide. So our team came up with a simple yet effective solution that can easily be solved with the help of AWS technologies. We proposed for the solution to be broken down into different phases, but the main features allows the saving of requirements, giving users the ability to upload a full body image for the system to predict body measurements as well as recommend different available fits to users based on saved measurements. The side features are included to make sure that users will be keeping the information updated for accuracy.\n You may be wondering though, how exactly does our solution benefit not just our customers, but ZALORA as well? Well, our solution can start out simple by estimating measurements to size guides with just code (AWS Lambda) based on user input before measuring its impact and pushing out more advanced features to customers gradually. ZALORA is a site that allows users to shop multiple brands in one place, and allowing customers to store measurements and compare the same data to multiple e-commerce brands at one go, saves time and improves the site’s retention rate. Convenience is a huge part of e-commerce but a huge trade off is the clothes not fitting right. So having a system for just storing and converting measurements can bring so much value for both customers and companies. Simple, yet effective.\n However, the solution is not entirely foolproof. Many listings in ZALORA can have a severe lack of information on their size guides, and without that information our solution will be obsolete if it doesn't apply to all/ every product. Through our research, it shows that the sizing information on listings of brands not listed correctly are actually available on their official sites. So it was not about a lack of data, but vendors not uploading fully accurate information into ZALORA. So we proposed a workaround to this problem: by pushing brands with accurate sizing info much higher up. \n In summary, our solution solves a simple issue with a simple solution in ZALORA. It is an effective solution in solving the given problem statement, being cost effective and easy to deploy, while it is also scalable with the help of AWS technologies.\n",
            "roles":"Team Lead, Solution Architect, Solution Prototype Creator \n I started off with the idea of joining this project alone, but eventually approached a close friend of mine Yo Ming for assistance as the deadline to the proposal submission was rather short. Being the team lead, I directed the team from research to prototype and finally the presentation. As the only member of the team familiar with the AWS cloud technologies, I handled the architecture and prototype of the solution alone with some help and mentorship from my lecturers back in Ngee Ann: Ms Siew Siew Ong and Mr Wesley Teo. \n",
            "learned":"Overall, I am extremely proud of the results created from the effort my team has put into this hackathon. Although like I mentioned in the video, the architecture of the solution could be improved based on some feedback given by the panel. But I feel that our team managed to create a well rounded solution that hit many good points, identified potential issues and listed their workarounds. Based on the QnA and feedback given by the panel right after the presentation was given, I would say that our team did a pretty great job as we managed to answer all of the panel’s questions. I’m proud of our achievement as a team with us both joining a hackathon for the first time. This also wouldn’t have been possible without the help of my teammate, Yo Ming.\nThank you all for reading.\n",
            "members":["Team Chicken Rice", "Wang Yongqing (self)", "Lai Yo Ming"],
            "achievements":"Champion (Tertiary Category, ZALORA)",
            "technologies":["AWS Technologies : Lambda, DynamoDB, S3 (Prototype)", "Figma"],
            "links":[{"devpost":"https://devpost.com/software/aws-build-on-challenge-2022"}]
        },
        {
            "id":3,
            "images":["Capstone2023/Capstone2023_Image_01.png","Capstone2023/Capstone2023_Image_02.png","Capstone2023/Capstone2023_Image_03.png","Capstone2023/Capstone2023_Image_04.png","Capstone2023/Capstone2023_Image_05.png"],
            "video":"",
            "title":"Interdisciplinary Capstone Project",
            "description":"An Interdisciplinary capstone (final year) project between ICT and business students, the team seeks to solve an issue for a client regarding displaying objects on their android TV. The client also proposed a solution with the usage of the Telegram application…",
            "flairs":["capstone","android","web-development","telegram"],
            "date":"Aug 2023",
            "about":"As an Interdisciplinary Capstone project, we were paired with an industry client and were approached with the problem of remotely controlling the on-screen displays of Android televisions. At present, the client had limitations with its current deployment setup due to it being inside their network and restricted by their firewall which prevented them from remotely accessing their internal devices easily. As such, they requested for the telegram application to be used to control their TVs which will not be restricted by their current network setup. Thus the team looked into the Telegram Bot API to act as an intermediary between the user and the android television(s). \n After much planning, research and discussion as a team we proposed to a client with a viable solution, one that was not exactly the way that they imagined, but still made use of telegram. The main components of the solution consisted of a Telegram chat bot, Telegram Web Application and an Android app (The architecture of the solution can be seen above). There were many considerations when we were designing this architecture, but we mainly wanted to deliver the following: easy to control, secure, fast, accessible; and the components above could help us achieve all that (kinda). \n The Telegram Web Application (Web App) would allow us to provide a user interface that the user can schedule/create a display for a TV, the Telegram chatbot would be for management features (eg; add TVs) and lastly the android application would do all the displaying on the TVs as long as the app was open. There were also some other features we added to the web application (as per requested by the client), such as allowing users to create simple display images from the Telegram Web App itself with the help of the Fabric.Js library. \n Other considerations also came into mind when designing this architecture. For example, the No-SQL database. SQL was initially considered due to its vertical scalability that would enable data to be kept consistently, however as it is extremely rigid with defined columns, data types, and relations, it makes changing data for implemented feature difficult. NoSQL was then considered as the team would not be limited by the database schema. Changes can be easily made as its scales well horizontally. Information also does not have to be strictly defined from the beginning, making implementation of additional features easy. Considering how the data we were dealing with did not require complex relations, we eventually settled on a No-SQL cloud database, MongoDB. \n",
            "roles":"Technical Lead, Backend Developer, Android Developer, Database Manager. \n As this was an interdisciplinary project working with Business & Accountancy (BA) students, I was the lead for ICT’s side, frequently communicating our ideas with them. Having the expertise in backend web development, I also handled all of the backend and database for the web application as well as the android app for displaying. I also directed a huge part of the UI/UX in the web app’s front end which my partner, Celsius, was creating. \n",
            "learned":"This was the first time I worked on an Interdisciplinary project in ICT where we teamed up with students from the School of BA (Alicia and Hannah) to complete a project for a client. Being the Technical Lead was challenging but fruitful as I had to frequently communicate the direction of our project to individuals not in tech and unfamiliar with a lot of the stuff we do in ICT. At first it was difficult as dropping tech terms was a norm to me, but being the lead for ICT’s side meant it was my responsibility to bring across my ideas and thoughts in a way that non technical people could understand and it challenged me to put myself in their perspective and distill technical concepts into more straightforward language, shedding unnecessary jargon and intricacies. I happened to also find myself understanding my basic concepts more through their questions. \n Working with business studies students has opened my perspective more to the world outside of tech, showing me that when people of disciplines and perspectives work together it can create a more well rounded and overall better solution. This interdisciplinary capstone was definitely an experience not everyone got and I’m appreciative for. If there comes another opportunity to participate in an interdisciplinary project again, I would be sure to take it up. \n (Note: Fewer pictures and No links are provided to the application/repository as it is maintained confidential for security reasons) \n ",
            "members":["Team PB&J",
            "Wang Yongqing, self (School of Infocomm and Technology)",
            "Celsius Chia (School of Infocomm and Technology)",
            "Hannah Chew (School of Business and Accountancy)",
            "Alicia Lie (School of Business and Accountancy)"
            ],
            "achievements":"Grade: A+",
            "technologies":["Language(s) / Framework(s): VueJs, Laravel, Android Java, Python","IDE: Android Studio, PHPStorm, VSCode","Notable Libraries: Fabric.JS"],
            "links":[]
        },
        {
            "id":4,
            "images":["GooglePayRedone/GooglePayRedone_Image_01.png","GooglePayRedone/GooglePayRedone_Image_02.png","GooglePayRedone/GooglePayRedone_Image_03.png","GooglePayRedone/GooglePayRedone_Image_04.png","GooglePayRedone/GooglePayRedone_Image_05.png"],
            "video":"",
            "title":"Google Pay Logo Redesigned",
            "description":"For a Year 1 Semester 1 assignment on Design Principles, I redesigned the Google Pay logo for clarity and coherence within the Google app ecosystem. Adhering to Google's design characteristics, I crafted a simplified, colorful, and elucidated wallet icon with a subtle credit card detail using Adobe Illustrator.",
            "flairs":["design","Illustrator"],
            "date":"May 2021",
            "about":"This project was an assignment given in Year 1 Semester 1 for the project Design Principles. For this assignment, we were tasked with the goal of redesigning a logo. Thus I set out to do my research on logos that I felt were vague and could be better, eventually settling on Google Pay as I felt that the logo was a little too ambiguous and could convey a stronger meaning while fitting it within the google app ecosystem. \n To recreate the ‘Google’ look, I first had to identify what features google application logos have that makes them look GOOGLE. Based on what I have studied, they all embody the following characteristics: a simplistic design, follows the same Google colour palette, no vivid outlines and light shadows to convey some level of depth. So using these key features I drafted different ideas around the idea of a ‘wallet’ and added some details to the final draft before going into Adobe Illustrator to create the final product. \n Finally, with Adobe Illustrator I designed the Google Pay Logo to one that resembled more of a wallet with some accents to depict a credit card in front while keeping the same characteristics of Google apps, so it looks just like an originally created. \n",
            "roles":"For this project I handled all processes myself from ideation to research and final product. \n",
            "learned":"When I finished the project, I was quite proud of the final result as it was exactly what I had envisioned it to look like from the beginning. The wallet swivel look and the credit card in the front. I was also really pleased with the grade I received. However, looking back at it I somewhat understood more of the original Google Pay Logo with the Google colours more prominent in them. While my design contained a lot more neutral shades of grey and contained more details with its ‘flaps’, that reduced some of its impact as a ‘Google’ logo. Although my logo did contain less ambiguity on its purpose and meaning, its visual impact has also reduced in exchange. \n All in all, this was a fantastic assignment introducing me to Adobe Illustrator and an eye opening experience to how logos are designed and the amount of thought that goes behind them. \n",
            "members":["Wang Yongqing (self)"],
            "achievements":"Grade: AD (Distinction)",
            "technologies":["Adobe Illustrator"],
            "links":[]
        },
        {
            "id":5,
            "images":["ZxshellAnalysis/ZxshellAnalysis_Image_01.png","ZxshellAnalysis/ZxshellAnalysis_Image_02.png"],
            "video":"https://youtu.be/TuVZkCVDKtQ",
            "title":"Malware Analysis of Zxshell",
            "description":"In this project, we analyzed the popular Remote Access Trojan (RAT), Zxshell both dynamically and statically with popular malware analysis tools to uncover what possibly happens behind infected systems.",
            "flairs":["malware analysis"],
            "date":"Feb 2023",
            "about":"This project was an assignment for the module ‘Malware Analysis Tools & Techniques’  where we were equipped with basic and advanced skills in analyzing malwares both statically and dynamically. For this assignment, we chose ZxShell, a remote access trojan as our malware to be analyzed. \n In summary, through our analysis we learned how the malware DLL installs itself within the system to avoid detection. It injects itself into a valid windows process that isn’t used by running through a list of services and runs its using svchost.exe. This way it masks the presence as a legitimate windows service to bypass visual detection. Svchost runs many different services adding to the noise, making it harder to detect. After installation and injecting itself into the system, the ShellMain function runs before the ShellMainThread. The ShellMainThread calls for a function that checks the registry path every 2 seconds to ensure that it hasn’t been modified, or discovered. If it is, the malware would lay low for a bit. To make a connection with the controller, the malware masks its outgoing connection to the by sending a request through the default browser, in most cases internet explorer. Some features of Zxshell includes collecting the information infected computer, a keylogger, connect to a proxy service, access video or display hardware. \n Watch the video above for the full analysis of the report on the malware. \n",
            "roles":"Advanced Static and Dynamic Analysis. \n",
            "learned":"This was an extremely challenging assignment as although we were taught on how to use the tools and equipped with some of the skills, it was our first time dealing with a whole packaged malware used to target legitimate individuals and organizations. Researching into this malware was like dealing with a black box problem and it built a lot of perseverance in myself due to the amount of research it needed and tenacity it required. Despite how difficult this assignment was, I left this module feeling even more inspired and interested in Malware Analysis as I loved the challenge it gave and the occasional ‘Wonka’ moments I had. It was a fantastic introduction and insight into malware analysis.\n",
            "members":["Wang Yongqing (self)","Lai Yo Ming"],
            "achievements":"Grade: A",
            "technologies":["VMware","Basic Analysis: WinMD5, Bintext, PEiD, PEview, Dependency Walker, Procmon, Regshot, ApateDNS, NetCat","Advanced Analysis: IDAPro, OllyDbg"],
            "links":[]
        },
        {
            "id":6,
            "images":["EthicalHacking/EthicalHacking_Image.png","EthicalHacking/EthicalHacking_Image_01.png","EthicalHacking/EthicalHacking_Image_02.png","EthicalHacking/EthicalHacking_Image_03.png","EthicalHacking/EthicalHacking_Image_04.png","EthicalHacking/EthicalHacking_Image_05.png","EthicalHacking/EthicalHacking_Image_06.png","EthicalHacking/EthicalHacking_Image_07.png","EthicalHacking/EthicalHacking_Image_08.png"],
            "video":"https://youtu.be/_7C8T74Rfio",
            "title":"Exploitation & Post Exploitation leveraging on Log4shell",
            "description":"An ethical hacking project where we demonstrated a possible use case scenario with the Log4j vulnerability. Building the scenario from the ground up, we set up realistic virtual test environments and performed skills from enumeration to post exploitation while making plausible assumptions along the way.",
            "flairs":["ethical hacking"],
            "date":"Oct 2023",
            "about":"In this project, we demonstrated exploitation and post exploitation scenarios based on a use case created for an assignment under the Ethical Hacking module. The assignment built to simulate a possible real life scenario of a breach that can occur from vulnerabilities left unpatched or unfixed by organizations. \n Use Case: Amid the Covid-19 pandemic, Gary, a disgruntled ex-employee of QUASO Pte Ltd, discovers the company's security negligence. The GoFinance website, essential for financial services, is vulnerable due to an unpatched Log4j zero-day exploit. Fueled by resentment, Gary exploits this vulnerability to infiltrate QUASO's internal FTP server, aiming to retrieve crucial documents. His actions underscore the severe risks organizations face when overlooking security measures, endangering sensitive data and assets. \n The exploit can be broken down into 3 main sections. Starting with the Web server exploitation using Log4shell, followed by the pivoting to the FTP server using Chisel and lastly gaining access into an FTP server with Hydra’s brute forcing. \n Web Server Exploitation: In our use case we exploited the Log4j shell to gain access into the web server of the company first. So what is Log4j (Log4shell)? Log4j is a widely used Java logging framework, favored by services like iCloud and Amazon, offering developers control over log messages for monitoring and debugging. However, the framework faced a critical vulnerability known as Log4Shell (CVE-2021-44228) in 2021, allowing unauthenticated remote code execution. Exploiting Log4j's \"JNDI lookup\" feature, attackers could insert malicious log messages, posing a severe threat due to Log4j's widespread use in various software. This vulnerability attracted ransomware attackers, turning Log4j into a weapon for global exploitation. So using Log4shell, we conducted a simple demonstration with the help of a proof of concept application (credits: kozmer on github) to gain access into my Parrot server hosted (victim). \n Pivoting to FTP Server: After gaining access to the server with Log4j, we would like to pivot to a different IP address in the same subnet with the help of Chisel, assuming that Gary knows the existence of the server and discovers the port with some enumeration. Chisel is a server client model that allows us to create a TCP tunnel between our kali and webserver transported over HTTP and secured via SSH. With Chisel, we can set up a reverse local tunnel that pivots connection from our attacker through a local port 2121 of the client system to be forwarded to the FTP server via the Chisel Server. Basically with chisel, we remove the need of going through the Log4j vulnerability opening. \n Gaining access to FTP Server: Finally, with Hydra we can brute force the ftp system through the tunnel with have created to gain full access into the FTP server. \n Post-Explotation: For post exploitation, I conducted 2 activities. First being SSH cracking and persistence, and Secondly being Gaining RCE access using LFI. I will only be talking more about the former. For this post exploit, we find that ssh is open to our ftp server with a key. Looking back into our ftp server, we notice that our ftp server has the files we need but we cant get yet as we’re still on the command port (21) and not the data port (20 / random). This becomes troublesome as currently our connection to the ftp server is pivoting via the web server, not accessed directly. We could consider intercepting the traffic and altering it while using another local pivot but chisel is already acting as a proxy. So the solution? Instead of creating a reverse local tunnel using chisel, we will use a reverse dynamic SOCKS proxy instead. Using a dynamic socks proxy, we can listen to multiple ports at the same time, allowing our ftp data connection to go through since it is no longer just listening to a single port. The requests sent now are also sent as if it came from our pivot. With the new connection, we can retrieve the SSH keys in the FTP server and crack the keys using John the Ripper. Once the keys are cracked, we can access the server via ssh. Lastly, to maintain persistence, we can use Dnscat2 to perform dnstunneling. \n Watch the video above for the full demonstration on post exploitation. \n",
            "roles":"In this project, I planned most and executed most of the Exploitation phase by myself (team portion) and conducted 2 post exploitation activities (individual portion) \n",
            "learned":"This project was by far the toughest assignment given in Ngee Ann. Not only did we have to create the scenario, all environments and setups had to be created from scratch to demonstrate their vulnerabilities. This meant a lot of time was spent figuring out how to put the vulnerability in the web server, set up the VM network configurations, before finding out how to exploit them and getting tools to work. The biggest regret I had on this assignment was not being able to figure out how to do Tunneling to a different IP (not of the same subnet). Given the time I would give that technique a shot again. However this project/assignment was a valuable experience that definitely brought me back to my fundamentals and threw me into the world of ethical hacking, forcing me to build from the ground up. \n",
            "members":["Wang Yongqing (self)","Lai Yo Ming"],
            "achievements":"Grade: A",
            "technologies":["VM(s): Kali Linux, Parrot OS, Ubuntu", "Explotation: Log4shell POC by kozmer, Chisel, Hydra", "Post-Exploitation: Dnscat2, JohntheRipper"],
            "links":[]
        }
    ]
}